system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//~ convertToMeters 0.001;
convertToMeters 1.0;

vertices
(
    (-0.127 -0.125 0.0)
    (0.5075 -0.125 0.0)
    (0.5075 0.125  0.0)
    (-0.127  0.125  0.0)
    (-0.127 -0.125 0.25)
    (0.5075 -0.125 0.25)
    (0.5075 0.125  0.25)
    (-0.127  0.125  0.25)
);

blocks
(	
	hex (0 1 2 3 4 5 6 7) (112 43 43)  simpleGrading (((0.42 0.65 1) (0.58 0.35 2.5)) 
                                                      ((0.25 0.24 1.5) (0.5 0.52 1) (0.25 0.24 0.5)) 
                                                      ((0.25 0.25 1.5) (0.5 0.5 1) (0.25 0.25 0.5))
                                                     )
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
          (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
          (2 6 5 1)
        );
    }
   
    walls
    {
        type wall;
        faces
        (
          (3 7 6 2)
          (1 5 4 0)
          (0 3 2 1)
          (4 5 6 7)
        ); 
    }
);

mergePatchPairs
(
);
