system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 topoSetDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

actions
(
//    {
//	name	toDel;
//	type	faceSet;
//	action	new;
//	source	patchToFace;
//	sourceInfo
//	{
//		name	inlet;	
//	}
//    }
//    {
//	name 	inBox;
//	type 	faceSet;
//	action 	new;
//	source	boxToFace;
//	sourceInfo
//	{
//		//~ box (-0.048 -0.1235 0.0015)(-0.045 0.1235 0.2485); 
//		box (-0.8 -0.125 0.0015)(-0.0 1.125 0.2485); 
//	}
//    }
//   {
//	name	toDel;
//	type	faceSet;
//	action	delete;	
//	source	faceToFace;
//	sourceInfo
//	{
//		set	inBox;	
//	}
//  }
//    {
//	name 	inletN;
//	type	faceSet;
//	action 	new;
//	source	patchToFace;
//	sourceInfo
//	{
//		name	inlet;
//	}
//    }
    {
	name 	SlipBC;
	type	faceSet;
	action 	new;
	source	patchToFace;
	sourceInfo
	{
		name	walls;
	}
    }
    {
	name 	toDel2;
	type 	faceSet;
	action 	new;
	source	boxToFace;
	sourceInfo
	{
		//~ box (-0.048 -0.1235 0.0015)(-0.045 0.1235 0.2485); 
		box (-0.0076 -1.125 -1.00)(1 1.125 1.25);
	}
    }
    {
	name 	SlipBC;
	type	faceSet;
	action	delete;
	source	faceToFace;
	sourceInfo
	{
		set toDel2;
	}
    }
//    {
//	name 	inletN;
//	type	faceSet;
//	action	delete;
//	source	faceToFace;
//	sourceInfo
//	{
//		set toDel;
//	}
//    }
);
// ************************************************************************* //
